{"pageProps":{"projects":[{"title":"Onoes","image":"onoes.png","link":"https://khendrikse.github.io/onoes/","order":1,"content":"\nI wanted a pomodoro-type timer that I could customize and that looked cute. So I made it. Another big learn for me was that I was just gonna make it, publish it, and not look back anymore. Fighting perfectionism and focus my time actually using the app, and not feeling very self-aware about the code itself. Knowing I could do better, but deciding I don't want to. Hah!\n"},{"title":"Streamkiwi","image":"streamkiwi.png","link":"https://streamkiwi.app/","order":2,"content":"\nI like watching the dev community on Twitch. But while using the platform I wished there was a way to get an overview of all the people you were following, and when they were going to stream next.\nSo I built it! The app is built using Nextjs, @veccu/react-calendar and the Twitch API.\n"},{"title":"What genre","image":"whatgenre.png","link":"https://whatgenre.herokuapp.com/","order":3,"content":"\nWhen I first started coding I noticed the importance of building your own projects that you can feel passionate about. What Genre was one of the first projects I did. Using Spotify's API it checks what genre a given artist has.\n"},{"title":"Spotify to slack","image":"spotify-to-slack.png","link":"https://github.com/khendrikse/spotify-to-slack","order":4,"content":"\nWhen I just started with JavaScript, I created a little app inspired by msn statusses from back in the day. You can run it locally to sync the song you're listening to on Spotify with your Slack status.\n"},{"title":"Pasteldeck","image":"pasteldeck.png","link":"https://khendrikse.github.io/pasteldeck/","order":5,"content":"\nI was in a fun mood so I made a cute slideshow generator. I would not recommend it for heavy use. But I would recommend it if you quickly need a cute looking pastel slideshow with little text.\n"},{"title":"Oob this","image":"oob-this.png","link":"https://oob-this.netlify.com/","order":6,"content":"\nOne of my favorite podcasts 'delete this' inspired me to create a small website that replaces each vowel in a word with 'oob'. It was loads of fun to make and I totally geeked out when they mentioned it in their podcast.\n"}],"title":"Karin Hendrikse","description":"A personal playground and portfolio."},"__N_SSG":true}