{"pageProps":{"title":"Blog - remote | Karin Hendrikse","categories":["beginner","programming","learning","accessibility","html","productivity","career","watercooler","remote","javascript","npm","yarn","codenewbie","teaching","tutorial","hacktoberfest","open-source","theme","vsc","pastel"],"posts":[{"layout":"post","title":"How to stay connected to your co-workers","published":true,"oldBlog":true,"date":"2020-12-14","description":"Staying connected in a work-from-home world","intro":"Let’s be honest, every post nowadays starts with how weird 2020 has been. So I am doing the same; it’s been weird. There. Having been working from home full-time since March, it has been both a productivity booster and an isolating experience. Especially in the beginning.","tags":"productivity, career, watercooler, remote","cover_image":"https://dev-to-uploads.s3.amazonaws.com/i/tezp8yhoehwjfk0ryhhg.jpg","cover_image_alt":"a neon light sign saying hey y'all","markdownBody":"Cover image by [DJ Johnson](https://unsplash.com/@dj_johns1?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText) on [Unsplash](https://unsplash.com/@dj_johns1?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText)\n\n## In the beginning...\n\nThe first Monday our department was working from home was new and interesting. People joined in a morning hangout to chat a bit and discuss what was happening in the world. I texted my friends: ‘*This is so much fun! I got to see a bunch of colleagues and their kids and pets in one screen!*’. I thought it was pretty cute to see the mayhem of cats trodding on keyboards and kids trying to get attention.\n\nOf course, trying to manage both work and kids at the same time soon became less cute and more work for most parents. For everyone reading this who dealt with that: you did a hell of a job. I look in awe at how you managed. Please try to be proud of yourself for going through this 👍.\n\n## Social initiatives\n\nHowever, not everyone was surrounded by family or roommates. Some of us said goodbye to social moments that normally power us through the day. Thankfully it was amazing to see the initiatives people came up with. Every morning we had a 'kitchen hangout' just to pop in and chat with co-workers. But especially in those first few weeks the 'library hangout' provided some support to those who worked alone from home and felt additional stress from what was happening in the world.\n\nYou’d open up the library hangout, turn off your mic and just work on stuff. No talking, just companionship. It was pretty cool. Thursday evenings became game night, and Fridays were set to have a remote afternoon of drinks and chill out.\n\nAll of this has subsided somewhat now. We are all a bit more used to this way of working, and we have been able to get a bit more socialising in during our free time. Still, how can we make sure we stay connected to our coworkers while working from home?\n\n## The 'why'\n\nNow, of course social interactions can also be energy draining for people. I am very much against pushing people into interactions that they do not feel comfortable with. Still, there is more to connecting with co-workers than the social aspect:\n\n- You get to find out what other people and teams are working on and learning from.\n- It is cool to find common ground and interests\n- You build a stronger foundation for working together on projects\n- It helps you find opportunities for your personal growth and the growth of others\n- The next time you are stuck on something, and you might need help that your teammates can not provide, you know who to turn to.\n\n## The 'how'\n\nDefault social places that we have for those who need an extra social kick:\n\n- **The Kitchen hangout** - there is still a kitchen hangout every day! And people still go there to chat a bit.\n- **Game night** - the game night stayed with us!\n- **Borrel** - there is a borrel every Friday, sometimes musical colleagues share some tunes.\n- **Donut** We've been really enjoying [Donut](https://www.donut.com/). In our case, donut will match you up with one or more people for a small chat once a week whenever you feel like it. It is still opt-in when the match is made.\n\nMore work related:\n\n- **Guilds** the benefits stated above are available for us in our frontend and backend guilds. It can be super nice to visit guilds because it keeps you up-to-date on what other people are working on, and allows for more in-depth discussions and idea sharing. We provide different types of meetings, from technical discussions to show-and-tells. We also mix the frontend and backend guild every once in a while.\n- **Standups** - start your standup 5 minutes earlier to chat a bit more with your colleagues about something else but work.\n- **Project check-ins** - working on a cross-team project? How about saying no to slack every now and then and just doing a short hangout to sync up?\n- **Team retro’s** - just in case you’re not doing them yet. It can be super nice to help people express how they feel about the way things are going and improve on team work. We have been using [Parabol](https://www.parabol.co/) to help manage the retro's.\n- **Just message a random colleague outside your team** - A fun challenge to message a random colleague and ask what they have been working on.\n\nThat's my input! Nothing new probably. But I am curious how you stay connected and how this has all been for you?\n","slug":"how-to-stay-connected-to-your-co-workers"}],"currentCategory":"remote"},"__N_SSG":true}