{"pageProps":{"siteTitle":"Karin Hendrikse","frontmatter":{"layout":"post","title":"Cozy Vim color schemes","published":false,"description":null,"intro":"Ahh... to be as cozy as a cat loaf. It's hard for us humans to achieve the same comfort. But having your Vim scheme set up properly to give you a relaxed vibe might just be the next best thing. If you are looking for some cute, cozy, fluffy and pastel color schemes for Vim, you've come to the right place. Here are 9 highly curated schemes just for you.","cover_image":"2021-08-17.jpg","cover_image_alt":"a white cat napping"},"markdownBody":"\nPhoto by [Joyful](https://unsplash.com/@joyfulcaptures?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText) on [Unsplash](https://unsplash.com/?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText)\n\n### [1989](https://github.com/sonjapeterson/1989.vim)\n\nIf you are a big Taylor Swift fan... Well then don't look any longer! Here she is! This Taylor Swift themed color scheme [1989](https://github.com/sonjapeterson/1989.vim) is cute... it's pastel... there are gorgeous pinks, purples and yellows on a soft grey background. I'd say: It takes this way too far, and it'll leave you breathless.\n\n![example of the 1989 vim colorscheme](vim-color-schemes/t-1989.png)\n\n### [Cosme](https://github.com/beikome/cosme.vim)\n\nI know. You must think \"isn't this the same as 1989?\". No, it's called [Cosme](https://github.com/beikome/cosme.vim)! It is SO MUCH like the 1989 theme (a little less cute tbh) but wait... There is more. Because have you seen that gorgeous vim-airline theme it has going on at the bottom? Yes! Hear me out: like 1989 better than Cosme? Why not combine that beauty with the cosme airline theme. Yes. You're welcome.\n\n![example of the Cosme vim colorscheme](vim-color-schemes/t-cosme.png)\n\n### [Alabaster](https://github.com/agudulin/vim-colors-alabaster)\n\nIf you are going for minimalism and the only reason you are not working full black and white is because that is too boring for you and is simply one bridge too far. This is perfect for you! [Alabaster](https://github.com/agudulin/vim-colors-alabaster) is a super minimalistic scheme. Black text on a white background, with some sprinkles of pastel greens, purply pinks, yellows and blues. It especially thrives on a split terminal screen as seen with this example of NERDtree.\n\n![example of the Alabaster vim colorscheme](vim-color-schemes/t-alabaster.png)\n\n### [Dogrun](https://github.com/wadackel/vim-dogrun)\n\n[Dogrun](https://github.com/wadackel/vim-dogrun) is as if a pastel puppy was (safely) put in the washer and dryer a bunch of times\\* and its cute coat just became fluffier and fluffier but also kind of toned down a bit. You get what I'm saying? I'm talking toned down red, light purple and some greens. It's darker for those that like it but I think it still has that cozy vibe to it.\n\n\\*Don't ever do this. This would not be okay. I'm scared writing this.\n![example of the Dogrun vim colorscheme](vim-color-schemes/t-dogrun.png)\n\n### [Espresso](https://github.com/gmoe/vim-espresso)\n\nCan you already smell [Espresso](https://github.com/gmoe/vim-espresso)? It has a dark grey background for some bitterness. The green and blue add some fresh acidity and last but not least some popping pink that brings just the right sweetness to it. Bitter, acidic and sweet. Need I say more?\n\n![example of the Espresso vim colorscheme](vim-color-schemes/t-espresso.png)\n\n### [Soft Era](https://github.com/soft-aesthetic/soft-era-vim)\n\nNow... Having the intense urge of sprucing up your coding experience with pastel colors that make you feel homely, cozy, relaxed and vibing does not mean that it's going to make for the most readable code. [Soft Era](https://github.com/soft-aesthetic/soft-era-vim) is a classic when it comes to smooth color vibes. It's just not that readable. Still cute though!\n\n![example of the Soft Era vim colorscheme](vim-color-schemes/t-soft-era.png)\n\n### Fairyfloss\n\nThose who love the pastel vibes in coding are probably already familiar with Amy Wibowo and her dreamy [FairyFloss](http://sailorhg.github.io/fairyfloss/) theme. Thankfully [FairyFloss](https://github.com/tssm/fairyfloss.vim) has been made available for Vim lovers too. The colors are mystical and dreamy with an actual okay amount of contrast. A classic that cannot be left out.\n\n![example of the fairy-floss vim colorscheme](vim-color-schemes/t-fairy-floss.png)\n\n### [Panda Syntax](https://github.com/markvincze/panda-vim)\n\nLike mentioned before, pastel colors are not always the best when it comes to readability. This is why I've stuck with [Panda Syntax](https://github.com/markvincze/panda-vim) for such a long time. Even though it's not very pastel, I still think it's very cute. As a little extra, I would recommend having this tasty scheme together with the [Fruit Punch Airline Theme](https://github.com/vim-airline/vim-airline-themes/blob/master/autoload/airline/themes/fruit_punch.vim).\n\n![example of the Panda Syntax vim colorscheme](vim-color-schemes/t-panda.png)\n\n\n### [Tsen Magenta Yellow](https://github.com/marreman/tsen-magenta-yellow)\n\nSomething about the purple inspired [Tsen Magenta Yellow](https://github.com/marreman/tsen-magenta-yellow) calms me so much. Even though it is simple, I love the yellow notes that it brings. I could say more but I'll just let you rest and have a moment of calmth to process these blissful colors.\n\n![example of the Tsen Magenta Yellow vim colorscheme](vim-color-schemes/t-tsen-magenta-yellow.png)\n\nMost pastel/purple/pink themes or color schemes are really low contrast. They are therefore [not very accessible](https://www.a11yproject.com/posts/2015-01-05-what-is-color-contrast/) to everyone. Of course it still depends on the individual, but I did do a quick check. And the following should be somewhat compliant to the [WCAG 2.0 guidelines for contrast accessibility](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html):\n- 1989\n- Cosme\n- Alabaster\n- Tsen Magento Yellow (almost)\n","date":["2021-08-17"]},"__N_SSG":true}